STMicroelectronics/STM32CubeWB/Projects/P-NUCLEO-WB55.USBDongle/Applications/Thread/Thread_Coap_DataTransfer/STM32_WPAN/App/app_thread.c
  /* Init config buffer and call TL_THREAD_Init */
  APP_THREAD_TL_THREAD_INIT();

  /* Configure UART for sending CLI command from M4 */
  APP_THREAD_Init_UART_CLI();

  /* Send Thread start system cmd to M0 */
  ThreadInitStatus = SHCI_C2_THREAD_Init();
  /* Prevent unused argument(s) compilation warning */
  UNUSED(ThreadInitStatus);
  /* Register task */
  /* Create the different tasks */
  UTIL_SEQ_RegTask( 1<<(uint32_t)CFG_TASK_MSG_FROM_M0_TO_M4, UTIL_SEQ_RFU, APP_THREAD_ProcessMsgM0ToM4);
  UTIL_SEQ_RegTask( 1<<(uint32_t)CFG_TASK_SEND_BUFFER, UTIL_SEQ_RFU, APP_THREAD_SendNextBuffer);
  UTIL_SEQ_RegTask( 1<<(uint32_t)CFG_TASK_PROVISIONING, UTIL_SEQ_RFU, APP_THREAD_AskProvisioning);

  /* Initialize and configure the Thread device*/
  APP_THREAD_DeviceConfig();
}

/**
  * @brief  Trace the error or the warning reported.
  * @param  ErrId :
  * @param  ErrCode
  * @retval None
  */
void APP_THREAD_Error(uint32_t ErrId, uint32_t ErrCode)
{
  switch(ErrId)
  {
    case ERR_REC_MULTI_MSG_FROM_M0 :
      APP_THREAD_TraceError("ERR:ERR_REC_MULTI_MSG_FROM_M0 ", ErrCode);
      break;
    case ERR_REC_MULTI_TRACE_FROM_M0 :
      APP_THREAD_TraceError("ERR:ERR_REC_MULTI_TRACE_FROM_M0 ", ErrCode);
      break;
    case ERR_THREAD_SET_STATE_CB :
      APP_THREAD_TraceError("ERR:ERR_THREAD_SET_STATE_CB ", ErrCode);
      break;
   case ERR_THREAD_SET_CHANNEL :
      APP_THREAD_TraceError("ERR:ERR_THREAD_SET_CHANNEL ", ErrCode);
      break;
    case ERR_THREAD_SET_PANID :
      APP_THREAD_TraceError("ERR:ERR_THREAD_SET_PANID ", ErrCode);
      break;
    case ERR_THREAD_IPV6_ENABLE :
      APP_THREAD_TraceError("ERR:ERR_THREAD_IPV6_ENABLE ", ErrCode);
      break;
    case ERR_THREAD_START :
      APP_THREAD_TraceError("ERR:ERR_THREAD_START ", ErrCode);
      break;
    case ERR_THREAD_COAP_START :
      APP_THREAD_TraceError("ERR:ERR_THREAD_COAP_START ", ErrCode);
      break;
    case ERR_THREAD_COAP_ADD_RESSOURCE :
      APP_THREAD_TraceError("ERR:ERR_THREAD_COAP_ADD_RESSOURCE ", ErrCode);
      break;
    case ERR_THREAD_MESSAGE_READ :
      APP_THREAD_TraceError("ERR:ERR_THREAD_MESSAGE_READ ", ErrCode);
      break;
    case ERR_THREAD_COAP_SEND_RESPONSE :
      APP_THREAD_TraceError("ERR:ERR_THREAD_COAP_SEND_RESPONSE ", ErrCode);
      break;
    case ERR_THREAD_COAP_APPEND :
      APP_THREAD_TraceError("ERR:ERR_THREAD_COAP_APPEND ", ErrCode);
      break;
    case ERR_THREAD_COAP_SEND_REQUEST :
      APP_THREAD_TraceError("ERR:ERR_THREAD_COAP_SEND_REQUEST ", ErrCode);
      break;
    case ERR_THREAD_SETUP :
      APP_THREAD_TraceError("ERR:ERR_THREAD_SETUP ", ErrCode);
      break;
    case ERR_THREAD_LINK_MODE :
      APP_THREAD_TraceError("ERR:ERR_THREAD_LINK_MODE ", ErrCode);
      break;
    case ERR_ALLOC_MSG :
      APP_THREAD_TraceError("ERR:ERR_ALLOC_MSG ", ErrCode);
      break;
    case ERR_FILE_RESP_HANDLER :
      APP_THREAD_TraceError("ERR:ERR_FILE_RESP_HANDLER ", ErrCode);
      break;
    case ERR_MSG_COMPARE_FAILED :
      APP_THREAD_TraceError("ERR:ERR_MSG_COMPARE_FAILED ", ErrCode);
      break;
    case ERR_NEW_MSG_ALLOC:
      APP_THREAD_TraceError("ERR:ERR_NEW_MSG_ALLOC ", ErrCode);
      break;
    case ERR_PROVISIONING_RESP:
      APP_THREAD_TraceError("ERR:ERR_PROVISIONING_RESP ", ErrCode);
      break;
    case ERR_THREAD_DATA_RESPONSE:
      APP_THREAD_TraceError("ERR:ERR_THREAD_DATA_RESPONSE ", ErrCode);
      break;
    case ERR_APPEND:
      APP_THREAD_TraceError("ERR:ERR_APPEND ", ErrCode);
      break;
    case ERR_HEADER_INIT:
      APP_THREAD_TraceError("ERR:ERR_HEADER_INIT ", ErrCode);
      break;
    case ERR_TOKEN:
      APP_THREAD_TraceError("ERR:ERR_TOKEN ", ErrCode);
      break;
     case ERR_THREAD_ERASE_PERSISTENT_INFO:
      APP_THREAD_TraceError("ERR:ERR_THREAD_ERASE_PERSISTENT_INFO ", ErrCode);
      break;
     case ERR_THREAD_CHECK_WIRELESS :
       APP_THREAD_TraceError("ERROR : ERR_THREAD_CHECK_WIRELESS ",ErrCode);
       break;
    default :
      APP_DBG("ERROR FATAL = %d\n", ErrId);
      APP_THREAD_TraceError("ERROR Unknown\n",0);
      break;
  }
}

/*************************************************************
 *
 * LOCAL FUNCTIONS
 *
 *************************************************************/

/**
 * @brief Thread initialization.
 *    This function configure the Thread mesh network.
 * @param  None
 * @retval None
 */
static void APP_THREAD_DeviceConfig(void)
{
  otError error;

  /* Configure the standard values */

  error = otInstanceErasePersistentInfo(NULL);
  if (error != OT_ERROR_NONE)
  {
    APP_THREAD_Error(ERR_THREAD_ERASE_PERSISTENT_INFO,error);
  }
  otInstanceFinalize(NULL);
  otInstanceInitSingle();
  error = otSetStateChangedCallback(NULL, APP_THREAD_StateNotif, NULL);
  if (error != OT_ERROR_NONE)
  {
    APP_THREAD_Error(ERR_THREAD_SET_STATE_CB,error);
  }
  error = otLinkSetChannel(NULL, C_CHANNEL_NB);
  if (error != OT_ERROR_NONE)
  {
    APP_THREAD_Error(ERR_THREAD_SET_CHANNEL,error);
  }
  error = otLinkSetPanId(NULL, C_PANID);
  if (error != OT_ERROR_NONE)
  {
    APP_THREAD_Error(ERR_THREAD_SET_PANID,error);
  }
  error = otIp6SetEnabled(NULL, true);
  if (error != OT_ERROR_NONE)
  {
    APP_THREAD_Error(ERR_THREAD_IPV6_ENABLE,error);
  }
  /* Start the COAP server */
  error = otCoapStart(NULL, OT_DEFAULT_COAP_PORT);
  if (error != OT_ERROR_NONE)
  {
    APP_THREAD_Error(ERR_THREAD_COAP_START,error);
  }
  /* Add COAP resources */
  error = otCoapAddResource(NULL, &OT_RessourceDataTransfer);
  if (error != OT_ERROR_NONE)
  {
    APP_THREAD_Error(ERR_THREAD_COAP_ADD_RESSOURCE,error);
  }
  /* Add APP_THREAD_AskProvisioning resources */
  error = otCoapAddResource(NULL, &OT_RessourceProvisionning);
  if (error != OT_ERROR_NONE)
  {
    APP_THREAD_Error(ERR_THREAD_COAP_ADD_RESSOURCE,error);
  }
  error = otThreadSetEnabled(NULL, true);
  if (error != OT_ERROR_NONE)
  {
    APP_THREAD_Error(ERR_THREAD_START,error);
  }
}


/**
 * @brief Thread notification when the state changes.
 *    When the Thread device change state, a specific LED
 *    color is being displayed.
 *    LED2 On (Green) means that the device is in "Leader" mode.
 *    LED3 On (Red) means that the device is in "Child: mode or
 *       in "Router" mode.
 *    LED2 and LED3 off means that the device is in "Disabled"
 *       or "Detached" mode.
 * @param  aFlags  : Define the item that has been modified
 *     aContext: Context
 *
 * @retval None
 */
static void APP_THREAD_StateNotif(uint32_t NotifFlags, void *pContext)
{
  /* Prevent unused argument(s) compilation warning */
  UNUSED(pContext);
  
  static uint32_t provisioning = 0;

  if ((NotifFlags & (uint32_t)OT_CHANGED_THREAD_ROLE) == (uint32_t)OT_CHANGED_THREAD_ROLE)
  {
    switch (otThreadGetDeviceRole(NULL))
  {
  case OT_DEVICE_ROLE_DISABLED:
    BSP_LED_Off(LED2);
    BSP_LED_Off(LED3);
    break;
  case OT_DEVICE_ROLE_DETACHED:
    BSP_LED_Off(LED2);
    BSP_LED_Off(LED3);
    break;
  case OT_DEVICE_ROLE_CHILD:
    BSP_LED_Off(LED2);
    BSP_LED_On(LED3);
    if (provisioning == 0)
    {
    HAL_Delay(3000U);
    UTIL_SEQ_SetTask(TASK_PROVISIONING, CFG_SCH_PRIO_1);
    }
    provisioning = 1U;
    break;
  case OT_DEVICE_ROLE_ROUTER :
    BSP_LED_Off(LED2);
    BSP_LED_On(LED3);
    break;
  case OT_DEVICE_ROLE_LEADER :
    BSP_LED_On(LED2);
    BSP_LED_Off(LED3);
    break;
  default:
    BSP_LED_Off(LED2);
    BSP_LED_Off(LED3);
    break;
  }
  }
}

/**
 * @brief Dummy request handler
 *
 * @param None
 * @retval None
 */
static void APP_THREAD_DummyReqHandler(void        * p_context,
                     otCoapHeader    * pHeader,
                     otMessage       * pMessage,
                     const otMessageInfo * pMessageInfo)
{
}

/**
 * @brief  Warn the user that an error has occurred.In this case,
 *     the LEDs on the Board will start blinking.
 *
 * @param  Mess  : Message associated to the error.
 * @param  ErrCode: Error code associated to the module (OpenThread or other module if any)
 * @retval None
 */
static void APP_THREAD_TraceError(const char * pMess, uint32_t ErrCode)
{
  APP_DBG("**** Fatal error = %s (Err = %d)",pMess,ErrCode);
  while(1U == 1U)
  {
  BSP_LED_Toggle(LED1);
  HAL_Delay(500U);
  BSP_LED_Toggle(LED2);
  HAL_Delay(500U);
  BSP_LED_Toggle(LED3);
  HAL_Delay(500U);
  }
}

/**
 * @brief  This function is used to compare the message received versus
 *     the original message.
 * @param  None
 * @retval None
 */
static void APP_THREAD_CheckMsgValidity(void)
{
  uint16_t mMsgId=OT_BufferIdRead - 1U; /* Corrected MsgId (MsgId starts at 1, not at 0) */
  uint32_t mOffset = COAP_PAYLOAD_MAX_LENGTH*mMsgId; /* the starting offset */
  uint32_t i;
  bool valid =true;

  for(i = mOffset; i < mOffset+COAP_PAYLOAD_MAX_LENGTH; i++)
  {
    if(OT_BufferReceived[i-mOffset] != aDataBuffer[i])
    {
      valid =false;
    }
  }

